#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3

#**************************************************************
# Create Clock
#**************************************************************

#create_clock -name {clk_50} -period 20.000 -waveform { 0.000 0.500 } [get_ports {clk}]

#**************************************************************
# Create Generated Clock
#**************************************************************

derive_pll_clocks
#create_generated_clock -name clk_sdram -source [get_pins {u3|altpll_component|auto_generated|pll1|clk[0]}] [get_ports {sdramClkOut}] 
#create_generated_clock -name sd1clk_pin -source [get_pins {mySysClock|altpll_component|pll|clk[1]}] [get_ports {sdr_clk}]

#**************************************************************
# Set Clock Uncertainty
#**************************************************************

derive_clock_uncertainty;

#**************************************************************
# Set Input Delay
#**************************************************************

#set_input_delay -clock clk_sdram -max 6.4 [get_ports sdram_dq*]
#set_input_delay -clock clk_sdram -min 0 [get_ports sdram_dq*]

#**************************************************************
# Set Output Delay
#**************************************************************

#set_output_delay -clock clk_sdram -max 1.5 [get_ports sdram_*]
#set_output_delay -clock clk_sdram -min -0.8 [get_ports sdram_*] -add_delay

#**************************************************************
# Set Multicycle Path
#**************************************************************

#set_multicycle_path -from [get_clocks {clk_sdram}] -to [get_clocks {u3|altpll_component|auto_generated|pll1|clk[3]}] -setup -end 2